print("Типы результата выражения:")

print(f"15 * 3 тип результата -> {str(type(15 * 3))[8:-2:].title()} \n"
      f"15 / 3 тип результата -> {str(type(15 / 3))[8:-2:].title()} \n"
      f"15 // 3 тип результата -> {str(type(15 // 3))[8:-2:].title()} \n"
      f"15 ** 3 тип результата -> {str(type(15 ** 3))[8:-2:].title()} \n")

print("Или другой способ (вывод такой же с применением атрибута __name__):")

print(f"15 * 3 тип результата -> {type(15 * 3).__name__.title()} \n"
      f"15 / 3 тип результата -> {type(15 / 3).__name__.title()} \n"
      f"15 // 3 тип результата -> {type(15 // 3).__name__.title()} \n"
      f"15 ** 3 тип результата -> {type(15 ** 3).__name__.title()} \n")
